Repository: ahmedalnagdy18/alopr
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Get Started with ALOPR
ar: ابدأ مع ALOPR

source: Create your account
ar: أنشـئ حسابك

source: Full Name
ar: الاسم الكامل

source: Enter your full name
ar: أدخل اسمك الكامل

source: Email
ar: البريد الإلكتروني

# pleaseEnterValidEmail
source: Please enter a valid email address
ar: بريدك الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Enter your phone number
ar: رقم هاتفك

source: Password
ar: كلمة المرور

source: Enter your password
ar: كلمة مرورك

source: Confirm Password
ar: تأكيد كلمة المرور

source: Re-enter your password
ar: أعد إدخال كلمة مرورك

source: Create Account
ar: إنشاء حساب

# iAlreadyHaveAccount
source: I already have an account,
ar: لدي حساب بالفعل،

source: Login
ar: تسجيل الدخول

source: Verify Your Email
ar: التحقق من بريدك الإلكتروني

# otpMessage
source: We’ve sent a 4-digit code to your email. Please enter it below to verify your account.
ar: لقد أرسلنا رمزًا مكونًا من أربعة أرقام إلى بريدك الإلكتروني. يُرجى إدخاله أدناه للتحقق من حسابك.

source: Verify
ar: تأكيد

# didReceiveCode
source: Didn't receive the code?
ar: لم تستلم الرمز؟

source: Click Resend
ar: انقر على "إعادة الإرسال"

source: Resend in,
ar: إعادة الإرسال في

source: Verification Successful!
ar: تم التحقق بنجاح!

# verifiedMessage
source: Your email has been verified. Welcome to ALOPR!
ar: تم التحقق من بريدك الإلكتروني. أهلاً بك في ALOPR!

source: Continue to Home
ar: متابعة إلى الصفحة الرئيسية

source: Follower
ar: متابع

source: Patient
ar: مريض

source: Welcome Back!
ar: مرحبًا بعودتك!

source: Log in to ALOPR
ar: تسجيل الدخول إلى ALOPR

source: Forgot Password?
ar: هل نسيت كلمة السر

# dontHaveAccount
source: Don’t have an account?
ar: ليس لديك حساب؟

source: Register
ar: تسجيل الدخول

source: Complete Your Profile
ar: أكمل ملفك الشخصي

# completeProfileSubTitle
source: Please provide the following details to personalise your ALOPR experience.
ar: يرجى تقديم التفاصيل التالية لتخصيص تجربة ALOPR الخاصة بك.

source: Caregiver Name
ar: اسم مقدم الرعاية

# caregiverField
source: Name of the person taking care of the patient
ar: اسم الشخص الذي يعتني بالمريض

source: Caregiver Phone Number
ar: رقم هاتف مقدم الرعاية

source: Condition
ar: الحالة

# conditionField
source: e.g., Mild memory loss, Moderate Alzheimer’s, Advanced Alzheimer’s
ar: مثال: فقدان ذاكرة خفيف، زهايمر متوسط، زهايمر متقدم

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Do you have chronic diseases ?
ar: هل لديك أمراض مزمنة ؟

source: Yes
ar: نعم

source: No
ar: لا

source: specify
ar: حدد

source: Are you pregnant ?
ar: هل انت حامل ؟

source: Finish
ar: إنهاء

source: Welcome to ALOPR Follower Dashboard
ar: مرحبًا بكم في لوحة معلومات المتابع ALOPR

source: Welcome to ALOPR
ar: مرحباً بكم في ALOPR

source: Upload Test
ar: تحميل الاختبار

# upload1Subtitle
source: Upload your latest medical test results for review
ar: حمّل أحدث نتائج فحوصاتك الطبية للمراجعة

source: Upload MRI
ar: تحميل صور الرنين المغناطيسي الخاصة بك

# upload2Subtitle
source: Share your brain MRI for analysis
ar: شارك مسح دماغك للتحليل

source: ALOPR Cognitive Test
ar: أداة الاختبار الخاصة بنا

# upload3Subtitle
source: Try our in-app cognitive test to check your memory and focus
ar: جرب اختبارنا المعرفي داخل التطبيق للتحقق من ذاكرتك وتركيزك

# emptyDocWidgetTitle
source: You have no patients yet. Once a patient connects with you, they will appear here
ar: ليس لديك أي مرضى حتى الآن. بمجرد اتصال أي مريض بك، سيظهر هنا.

source: Upload File
ar: تحميل الملف

source: Upload Your Test
ar: قم بتحميل الاختبار الخاص بك

source: Upload Scan
ar: تحميل المسح الضوئي

source: Upload Your MRI
ar: تحميل صور الرنين المغناطيسي الخاصة بك

# uploadPageSubtitle1
source: Please upload your latest medical test results in PDF or image format
ar: يرجى تحميل نتائج فحوصاتك الطبية الأخيرة بصيغة PDF أو صورة

# uploadPageSubtitle2
source: Please upload your brain MRI image for analysis
ar: يرجى تحميل صورة الرنين المغناطيسي لدماغك للتحليل.

# uploadPageSubtitle3
source: Take our quick memory and focus test to evaluate your cognitive skills
ar: قم بإجراء اختبار الذاكرة والتركيز السريع لتقييم مهاراتك المعرفية

source: Settings
ar: إعدادات

source: Accessibility
ar: إمكانية الوصول

source: Dark Mode
ar: الوضع المظلم

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Account
ar: حساب

source: Delete Account
ar: حذف الحساب

source: Log Out
ar: تسجيل الخروج

source: Terms and Conditions
ar: الشروط والأحكام

source: From Alzheimer’s Prediction
ar: من التنبؤ بمرض الزهايمر

# fullNameRequired
source: Full Name is required
ar: الاسم الكامل مطلوب

# nameTooShort
source: Name must be at least 3 characters
ar: الاسم يجب أن يكون 3 أحرف على الأقل

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# invalidEmail
source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صحيح

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# invalidPhone
source: Enter a valid phone number
ar: أدخل رقم هاتف صحيح

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordTooShort
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل

# confirmPasswordRequired
source: Confirm Password is required
ar: تأكيد كلمة المرور مطلوب

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# nameMinLength
source: Name must be at least 3 characters
ar: يجب أن يكون الاسم 3 أحرف على الأقل

# phoneInvalid
source: Enter a valid phone number
ar: أدخل رقم هاتف صحيح

# conditionRequired
source: Condition is required
ar: الحالة مطلوبة

# specifyRequired
source: Specify is required
ar: التحديد مطلوب

# langSnakBar
source: تم تغيير اللغة بنجاح
ar: Language changed successfully

source: Loading...
ar: تحميل...

source: Patient Details
ar: تفاصيل المريض

# patientDetailsSubTitle
source: Basic information provided by the patient.
ar: المعلومات الأساسية التي يقدمها المريض.

# uploadNewone
source: Change image
ar: استبدال الصورة

source: Please complete your profile
ar: من فضلك أكمل ملفك الشخصي

source: Image uploaded successfully
ar: تم رفع الصورة بنجاح

source: Complete your profile first
ar: يرجى إكمال ملفك الشخصي أولاً

source: Ok
ar: حسناً

# logoutTitle
source: Logout
ar: تسجيل الخروج

# logoutMessage
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# deleteAccountTitle
source: Delete Account
ar: حذف الحساب

# deleteAccountMessage
source: Are you sure you want to delete your account? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف حسابك؟ هذا الإجراء لا يمكن التراجع عنه.

# patientNotCompletProfile
source: The patient hasn’t completed their profile yet
ar: المريض لم يُكمل ملفه الشخصي بعد.

source: No internet connection!
ar: لا يوجد اتصال بالإنترنت!

# pleaseCheckYourInternet
source: Please check your internet and try again.
ar: من فضلك تحقق من اتصالك بالإنترنت وحاول مرة أخرى.

source: Did you forget your password?
ar: هل نسيت كلمة المرور؟

# forgetYoutPasswordALOPR
source: Forget yout password in to ALOPR
ar: نسيت كلمة المرور في تطبيق ألوبِر؟

source: Enter your email address
ar: أدخل عنوان بريدك الإلكتروني

source: Email Address
ar: عنوان البريد الإلكتروني

source: Reset password
ar: إعادة تعيين كلمة المرور

# setNewPassword
source: Set a new password
ar: عيّن كلمة مرور جديدة

source: New password
ar: كلمة المرور الجديدة

# passwordChanged
source: Your password has been changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

# question1
source: 1. Is your memory worse now than it was a year ago?
ar: 1. هل ذاكرتك الآن أسوأ مما كانت عليه قبل سنة؟

# question2
source: 2. Do you have difficulty remembering recent events?
ar: 2. هل تواجه صعوبة في تذكّر الأحداث القريبة؟

# question3
source: 3. Did you repeat the same question or statement more than once unintentionally?
ar: 3. هل تكرر نفس السؤال أو الكلام أكثر من مرة دون قصد؟

# question4
source: 4. Do you sometimes get lost in places that are familiar to you?
ar: 4. هل تضيع أحيانًا في أماكن مألوفة بالنسبة لك؟

# question5
source: 5. Do you take your medications regularly without reminders?
ar: 5. هل تتناول أدويتك بانتظام دون تذكير؟

# question6
source: 6. Can you handle money and buy everyday necessities yourself?
ar: 6. هل يمكنك التعامل مع النقود وشراء الحاجات اليومية بنفسك؟

# question7
source: 7. Can you prepare a simple meal yourself without forgetting the ingredients or steps?
ar: 7. هل يمكنك تحضير وجبة بسيطة بنفسك دون نسيان المكونات أو الخطوات؟

# question8
source: 8. Can you navigate to nearby places without getting lost?
ar: 8. هل يمكنك التنقّل إلى أماكن قريبة دون أن تضل الطريق؟

# question9
source: 9. Do you feel sad or have you lost interest in things you used to enjoy?
ar: 9. هل تشعر بالحزن أو فقدان الاهتمام بالأشياء التي كنت تستمتع بها؟

# question10
source: 10. Do you get enough sleep and feel rested when you wake up?
ar: 10. هل تنام عدد ساعات كافية وتشعر بالراحة بعد الاستيقاظ؟

# question11
source: 11. Do you regularly take any medications that might affect your memory?
ar: 11. هل تتناول أدوية بانتظام قد تؤثر على الذاكرة؟

# question12
source: 12. Have you ever been diagnosed with a vitamin deficiency, such as B12 or vitamin D?
ar: 12. هل تم تشخيصك مسبقًا بنقص في فيتامينات مثل B12 أو فيتامين D؟

# question13
source: 13. Have you become more withdrawn or less interested in interacting with others?
ar: 13. هل أصبحت أكثر انعزالًا أو أقل رغبة في التفاعل مع الآخرين؟

# question14
source: 14. Have you noticed any changes in your personality or general behavior (such as apathy or aggression)?
ar: 14. هل لاحظت تغيّرات في شخصيتك أو سلوكك العام (مثل اللامبالاة أو العدوانية)؟

# question15
source: 15. Are you having difficulty expressing your feelings or understanding the feelings of others?
ar: 15. هل تواجه صعوبة في التعبير عن مشاعرك أو فهم مشاعر الآخرين؟

# question16
source: 16. Are you becoming more easily distracted or finding it difficult to concentrate on a single task?
ar: 16. هل أصبحت أكثر تشتتًا أو تجد صعوبة في التركيز على مهمة واحدة؟

# assessmentTitle1
source: Level 1: Memory and noticeable changes
ar: المستوى الأول: الذاكرة والتغيرات الملحوظة

# assessmentTitle2
source: Level Two: Activities of Daily Living (IADL)
ar: المستوى الثاني: أنشطة الحياة اليومية (IADL)

# assessmentTitle3
source: Level Three: Reversible Causes
ar: المستوى الثالث: الأسباب القابلة للعكس

# assessmentTitle4
source: Level Four: Psychological and Behavioral State
ar: المستوى الرابع: الحالة النفسية والسلوكية

source: Overall assessment
ar: التقييم العام
